{"id": "1", "fields": {"url": "https://en.wikipedia.org/wiki/C_(programming_language)", "name": "C (programming language)", "description": "C (/ˈsiː/, as in the letter c) is a general-purpose computer programming language. It was created in the 1970s by Dennis Ritchie, and remains very widely used and influential. By design, C's features cleanly reflect the capabilities of the targeted CPUs. It has found lasting use in operating systems, device drivers, protocol stacks, though decreasingly for application software, and is common in computer architectures that range from the largest supercomputers to the smallest microcontrollers and embedded systems.", "popularity": 6630, "category": ["/language/c"], "publish_date": "2021-10-18T00:00:00+00:00"}}
{"id": "2", "fields": {"url": "https://en.wikipedia.org/wiki/C%2B%2B", "name": "C++", "description": "C++ (/ˌsiːˌplʌsˈplʌs/) is a general-purpose programming language created by Bjarne Stroustrup as an extension of the C programming language, or \"C with Classes\". The language has expanded significantly over time, and modern C++ now has object-oriented, generic, and functional features in addition to facilities for low-level memory manipulation. It is almost always implemented as a compiled language, and many vendors provide C++ compilers, including the Free Software Foundation, LLVM, Microsoft, Intel, Oracle, and IBM, so it is available on many platforms.", "popularity": 17369, "category": ["/language/c++"], "publish_date": "2020-12-15T00:00:00+00:00"}}
{"id": "3", "fields": {"url": "https://en.wikipedia.org/wiki/Java_(programming_language)", "name": "Java (programming language)", "description": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. It is a general-purpose programming language intended to let programmers write once, run anywhere (WORA), meaning that compiled Java code can run on all platforms that support Java without the need to recompile. Java applications are typically compiled to bytecode that can run on any Java virtual machine (JVM) regardless of the underlying computer architecture.", "popularity": 53338, "category": ["/language/java"], "publish_date": "2021-09-14T00:00:00+00:00"}}
{"id": "4", "fields": {"url": "https://en.wikipedia.org/wiki/Python_(programming_language)", "name": "Python (programming language)", "description": "Python is a high-level, interpreted, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation. Python is dynamically-typed and garbage-collected. It supports multiple programming paradigms, including structured (particularly procedural), object-oriented and functional programming. It is often described as a \"batteries included\" language due to its comprehensive standard library.", "popularity": 60873, "category": ["/language/python"], "publish_date": "2022-03-24T00:00:00+00:00"}}
{"id": "5", "fields": {"url": "https://en.wikipedia.org/wiki/Go_(programming_language)", "name": "Go (programming language)", "description": "Go is a statically typed, compiled programming language designed at Google by Robert Griesemer, Rob Pike, and Ken Thompson. It is syntactically similar to C, but with memory safety, garbage collection, structural typing, and CSP-style concurrency. It is often referred to as Golang because of its former domain name, golang.org, but its proper name is Go.", "popularity": 4178, "category": ["/language/go"], "publish_date": "2022-04-12T00:00:00+00:00"}}
{"id": "6", "fields": {"url": "https://en.wikipedia.org/wiki/Rust_(programming_language)", "name": "Rust (programming language)", "description": "Rust is a multi-paradigm, general-purpose programming language designed for performance and safety, especially safe concurrency. It is syntactically similar to C++, but can guarantee memory safety by using a borrow checker to validate references. It achieves memory safety without garbage collection, and reference counting is optional. It is a systems programming language with mechanisms for low-level memory management, but also offers high-level features such as functional programming.", "popularity": 1331, "category": ["/language/rust"], "publish_date": "2022-04-07T00:00:00+00:00"}}
{"id": "7", "fields": {"url": "https://en.wikipedia.org/wiki/Ruby_(programming_language)", "name": "Ruby (programming language)", "description": "Ruby is an interpreted, high-level, general-purpose programming language which supports multiple programming paradigms. It was designed with an emphasis on programming productivity and simplicity. In Ruby, everything is an object, including primitive data types. It was developed in the mid-1990s by Yukihiro \"Matz\" Matsumoto in Japan.", "popularity": 9754, "category": ["/language/ruby"], "publish_date": "2022-04-12T00:00:00+00:00"}}
{"id": "8", "fields": {"url": "https://en.wikipedia.org/wiki/Haskell_(programming_language)", "name": "Haskell (programming language)", "description": "Haskell (/ˈhæskəl/) is a general-purpose, statically-typed, purely functional programming language with type inference and lazy evaluation. Designed for teaching, research and industrial application, Haskell has pioneered a number of programming language features such as type classes, which enable type-safe operator overloading. Haskell's main implementation is the Glasgow Haskell Compiler (GHC). It is named after logician Haskell Curry.", "popularity": 0, "category": ["/language/haskell"], "publish_date": "2010-07-01T00:00:00+00:00"}}
{"id": "9", "fields": {"url": "https://en.wikipedia.org/wiki/C_Sharp_(programming_language)", "name": "C Sharp (programming language)", "description": "C# (/si ʃɑːrp/ see sharp) is a general-purpose, multi-paradigm programming language. C# encompasses static typing, strong typing, lexically scoped, imperative, declarative, functional, generic, object-oriented (class-based), and component-oriented programming disciplines.", "popularity": 13263, "category": ["/language/c#"], "publish_date": "2022-02-22T00:00:00+00:00"}}
{"id": "10", "fields": {"url": "https://en.wikipedia.org/wiki/JavaScript", "name": "JavaScript", "description": "JavaScript (/ˈdʒɑːvəskrɪpt/), often abbreviated JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. Over 97% of websites use JavaScript on the client side for web page behavior, often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices.", "popularity": 129861, "category": ["/language/javascript"], "publish_date": "2021-06-01T00:00:00+00:00"}}
{"id": "11", "fields": {"url": "https://en.wikipedia.org/wiki/TypeScript", "name": "TypeScript", "description": "TypeScript is a programming language developed and maintained by Microsoft. It is a strict syntactical superset of JavaScript and adds optional static typing to the language. It is designed for the development of large applications and transpiles to JavaScript. As it is a superset of JavaScript, existing JavaScript programs are also valid TypeScript programs.", "popularity": 17988, "category": ["/language/typescript"], "publish_date": "2021-06-01T00:00:00+00:00"}}
{"id": "12", "fields": {"url": "https://en.wikipedia.org/wiki/Perl", "name": "Perl", "description": "Perl is a family of two high-level, general-purpose, interpreted, dynamic programming languages. \"Perl\" refers to Perl 5, but from 2000 to 2019 it also referred to its redesigned \"sister language\", Perl 6, before the latter's name was officially changed to Raku in October 2019.", "popularity": 1337, "category": ["/language/perl"], "publish_date": "2022-03-13T00:00:00+00:00"}}
{"id": "13", "fields": {"url": "https://en.wikipedia.org/wiki/Dart_(programming_language)", "name": "Dart (programming language)", "description": "Dart is a programming language designed for client development, such as for the web and mobile apps. It is developed by Google and can also be used to build server and desktop applications. It is an object-oriented, class-based, garbage-collected language with C-style syntax. It can compile to either native code or JavaScript, and supports interfaces, mixins, abstract classes, reified generics and type inference.", "popularity": 2606, "category": ["/language/dart"], "publish_date": "2022-03-24T00:00:00+00:00"}}
